normalization_map = {
    "දෙනවයි":"දෙනවද",
    "දෙතහැක":"දෙනවද",
    "දෙනවැයි":"දෙනවද",
    "දෙනෙවැයි":"දෙනවද",
    "මක්කයි": "මොනවාද",
    "මක්කද": "මොනවාද",
    "ගාටන්නැතුව": "පරක්කු නොකර",
    "දෙනෝකෝ": "දෙන්න",
    "ඇහැක": "පුළුවන්ද",
    "ඇහැකිද": "පුළුවන්ද",
    "පුළුවන්ය": "පුළුවන්ද",
    "පුළුවනැ": "පුළුවන්ද",
    "කියතහැක": "කියන්න පුළුවන්ද",
    "මක්ක": "මොනවා",
    "කොයිබින්ද": "කොහේද",
    "මක්කටෙයි": "ඇයි",
    "යනවැයි": "යනවද",
    "නැතෙයි": "නැද්ද",
    "මොකෝ": "ඇයි",
    "කොරේ": "කළේ",
    "දොඩනවා": "කතා කරනවා",
    "කොයිබදැයි": "කොහේද",
    "මොනවැයි": "මොනවාද",
    "ගැනෙයි": "ගැනද",
    "කොහොමෙයි": "කොහොමද",
    "පේන්නෙ එහෙමෙයි": "පෙන්නේ එහෙමද",
    "එපාවෙලැයි": "එපා වෙලාද",
    "දන්නවැයි": "දන්නවද",
    "කොරන": "කරන",
    "ගතහැක": "ගත හැකිද",
    "කෙටිකරතැහැක": "කෙටි කරන්න පුළුවන්ද"
}

def normalize_sinhala(text):
    for wrong, correct in normalization_map.items():
        text = text.replace(wrong, correct)
    return text
